app/controllers/pacientes_controller.rb

  def create
    @paciente = Paciente.new(paciente_params)
    @paciente.endereco = Endereco.new(paciente_params[:endereco_attributes])

    respond_to do |format|
      if @paciente.save
---
INSERT INTO "enderecos" ("cep", "cidade", "bairro", "logradouro", "complemento", "created_at", "updated_at", "paciente_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pacientes" ("nome", "cpf", "email", "data_de_nascimento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_paciente
      @paciente = Paciente.find(params[:id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]